#include <MyProject.h>

QEPTypedef xdata mcQEP;


void EXTI_Init(void)
{
//    /*EXTI Input Pin 配置 ---------------------------------------- */
//    ClrBit(P1_OE, P11);  						/* 0: Disable digital output */
//    SetBit(P1_PU, P11);  						/* 0: Disable internal pull up */
//      
//    SetBit(P1_IE, P11);                     // P11作为外部中断口
//    ClrBit(P1_IF, P11);                     // 清除P11外部中断
//    /*-----------------------------------------------------------------------------------------------
//    外部中断模式配置
//    00: 上升沿产生中断  01: 下降沿产生中断  1x: 上升/下降沿产生中断
//  -------------------------------------------------------------------------------------------------*/
//    IT11 = 1;
//    IT10 = 0;

//    /*-------------------------------------------------------------------------------------------------
//    外部中断优先级配置及芯片中断总使能
//    PX01-PX00，中断优先级控制值从0-3依次表示优先级从最低到最高，共4级优化级控制
//    EX0，外部中断0使能
//    EA,芯片中断总使能
//    外部中断是否有滤波的配置，决定于选择硬件保护触发信号源，外部中断0或者比较器3中断。
//    若选择了比较器3中断，则外部中断无法进行滤波配置
//    -------------------------------------------------------------------------------------------------*/
//    PX11 = 1;
//    PX10 = 1;								// 中断优先级别3，中断优先级最高,
//    EX1 = 1;								// 使能外部中断1, P11作为外部中断输入源

//    IF0	 = 0;								// clear P00 interrupt flag
//    EA = 1;									// 使能全局中断


////////////////////测试模拟光耦//////////////////////////////////
    /*EXTI Input Pin 配置 ---------------------------------------- */
    ClrBit(P0_OE, P03);  						/* 0: Disable digital output */
    SetBit(P0_PU, P03);  						/* 0: Disable internal pull up */
      
    ClrBit(LVSR , EXT0CFG2);
    SetBit(LVSR , EXT0CFG1);
    SetBit(LVSR , EXT0CFG0);
    /*-----------------------------------------------------------------------------------------------
    外部中断模式配置
    00: 上升沿产生中断  01: 下降沿产生中断  1x: 上升/下降沿产生中断
  -------------------------------------------------------------------------------------------------*/
    IT01 = 0;
    IT00 = 0;

    /*-------------------------------------------------------------------------------------------------
    外部中断优先级配置及芯片中断总使能
    PX01-PX00，中断优先级控制值从0-3依次表示优先级从最低到最高，共4级优化级控制
    EX0，外部中断0使能
    EA,芯片中断总使能
    外部中断是否有滤波的配置，决定于选择硬件保护触发信号源，外部中断0或者比较器3中断。
    若选择了比较器3中断，则外部中断无法进行滤波配置
    -------------------------------------------------------------------------------------------------*/
    PX01 = 1;
    PX00 = 1;								// 中断优先级别3，中断优先级最高,
    EX0 = 1;								// 使能外部中断1, P11作为外部中断输入源

    IF0	 = 0;								// clear P00 interrupt flag
    EA = 1;	

}
    

